{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {
    "extensions": {
     "jupyter_dashboards": {
      "version": 1,
      "views": {
       "grid_default": {
        "col": 0,
        "height": 4,
        "hidden": false,
        "row": 0,
        "width": 4
       },
       "report_default": {
        "hidden": false
       }
      }
     }
    },
    "slideshow": {
     "slide_type": "skip"
    }
   },
   "outputs": [],
   "source": [
    "from string import Template\n",
    "from IPython.core.display import display, HTML\n",
    "\n",
    "%load_ext cypher\n",
    "%config CypherMagic.uri='http://neo4j:neo@localhost:7474/db/data'"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {
    "slideshow": {
     "slide_type": "skip"
    }
   },
   "outputs": [
    {
     "data": {
      "application/javascript": [
       "\n",
       "    require.config({ \n",
       "      paths: {\n",
       "        lodash: \"https://cdnjs.cloudflare.com/ajax/libs/lodash.js/4.17.15/lodash.min\",  \n",
       "        d3: \"https://d3js.org/d3.v4.min\"\n",
       "      }\n",
       "    })"
      ],
      "text/plain": [
       "<IPython.core.display.Javascript object>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "from IPython.display import HTML, Javascript, display\n",
    "\n",
    "def configure_d3():\n",
    "    \"\"\"Tell require where to get d3 from in `require(['d3'])`\"\"\"\n",
    "    display(Javascript(\"\"\"\n",
    "    require.config({ \n",
    "      paths: {\n",
    "        lodash: \"https://cdnjs.cloudflare.com/ajax/libs/lodash.js/4.17.15/lodash.min\",  \n",
    "        d3: \"https://d3js.org/d3.v4.min\"\n",
    "      }\n",
    "    })\"\"\"))\n",
    "\n",
    "\n",
    "configure_d3()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "extensions": {
     "jupyter_dashboards": {
      "version": 1,
      "views": {
       "grid_default": {
        "col": 4,
        "height": 4,
        "hidden": false,
        "row": 0,
        "width": 4
       },
       "report_default": {
        "hidden": false
       }
      }
     }
    },
    "slideshow": {
     "slide_type": "slide"
    }
   },
   "source": [
    "# Analysing structures with Software Analytics"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "extensions": {
     "jupyter_dashboards": {
      "version": 1,
      "views": {
       "grid_default": {
        "col": 8,
        "height": 4,
        "hidden": false,
        "row": 0,
        "width": 4
       },
       "report_default": {
        "hidden": false
       }
      }
     }
    },
    "slideshow": {
     "slide_type": "subslide"
    }
   },
   "source": [
    "## Question"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "subslide"
    }
   },
   "source": [
    "<center>Into which functional components is the system decomposed and are there cyclic dependencies between them?</center>"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "subslide"
    }
   },
   "source": [
    "## Data Sources"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "subslide"
    }
   },
   "source": [
    "* Java structures of the system must be scanned by jQAssistant and available in Neo4j\n",
    "* Identification of functional components in the source code must be possible"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "subslide"
    }
   },
   "source": [
    "## Heuristics"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "subslide"
    }
   },
   "source": [
    "* Every Packages that directly resides in \"com.buschmais.gymmanagement\" represents a functional component\n",
    "* All classes contined in these and in contained packages are part of the functional component"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "subslide"
    }
   },
   "source": [
    "## Validation"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "subslide"
    }
   },
   "source": [
    "* Graphical overview of the functional components and their dependencies\n",
    "* Tabular overview of cyclic dependendencies between functional components\n",
    "\n",
    "\n",
    "* Review of the functional components happens after the presentation by domain experts\n",
    "* Validation of functional dependencies for their correctness by domain experts\n",
    "* In case of issues: evaluation of the analysis or refactoring of the code"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "subslide"
    }
   },
   "source": [
    "## Implementation"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "subslide"
    }
   },
   "source": [
    "* Identification of functional components via sub packages in com.buschmais.gymmanagement\n",
    "* Enriching the graph with additional nodes per functional component (:FunctionalComponent)\n",
    "* Assignment of all Java types to the created :FunctionalComponent nodes\n",
    "\n",
    "\n",
    "* Aggregation of dependencies between types to the level of :Functional Components ([:DEPENDS_ON])\n",
    "* Number of dependencies (coupling) as property of the relation (weight)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "4 nodes created.\n",
      "4 properties set.\n",
      "23 relationships created.\n",
      "4 labels added.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <thead>\n",
       "        <tr>\n",
       "            <th>FunctionalComponent</th>\n",
       "            <th>ContainedTypes</th>\n",
       "        </tr>\n",
       "    </thead>\n",
       "    <tbody>\n",
       "        <tr>\n",
       "            <td>training</td>\n",
       "            <td>8</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>user</td>\n",
       "            <td>6</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>keycard</td>\n",
       "            <td>1</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>attendance</td>\n",
       "            <td>8</td>\n",
       "        </tr>\n",
       "    </tbody>\n",
       "</table>"
      ],
      "text/plain": [
       "[['training', 8], ['user', 6], ['keycard', 1], ['attendance', 8]]"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher\n",
    "MATCH          (:Package{fqn: \"com.buschmais.gymmanagement\"})-[:CONTAINS]->(p:Package)\n",
    "MERGE          (f:FunctionalComponent{name: p.name})\n",
    "WITH           p, f\n",
    "OPTIONAL MATCH (p)-[:CONTAINS]->(t:Type)\n",
    "MERGE          (f)-[:CONTAINS]->(t)\n",
    "RETURN         f.name AS FunctionalComponent, count(t) AS ContainedTypes"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "6 rows affected.\n"
     ]
    }
   ],
   "source": [
    "# Result is stored in a variable for usage in the result section\n",
    "dependencies = %cypher \\\n",
    "    MATCH  (fC1:FunctionalComponent)-[:CONTAINS]->(t1:Type), \\\n",
    "           (fC2:FunctionalComponent)-[:CONTAINS]->(t2:Type), \\\n",
    "           (t1)-[d:DEPENDS_ON]->(t2) \\\n",
    "    WITH   fC1, fC2, sum(d.weight) AS weight \\\n",
    "    MERGE  (fc1)-[:DEPENDS_ON{weight: weight}]->(fc2) \\\n",
    "    RETURN fc1.name AS Source, fc2.name AS Target, weight AS X_Count"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "0 rows affected.\n"
     ]
    }
   ],
   "source": [
    "# Result is stored in a variable for uasge in the result section\n",
    "cyclicDependencies = %cypher \\\n",
    "        MATCH (fC1:FunctionalComponent)-[:DEPENDS_ON]->(fC2:FunctionalComponent), \\\n",
    "              (fC2)-[:DEPENDS_ON]->(fC1) \\\n",
    "        WHERE fC1 <> fC2 \\\n",
    "        RETURN fC1 AS FunctionalComponent1, fC2 AS FunctionalComponent2"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "subslide"
    }
   },
   "source": [
    "## Results"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Visualization of the dependencies between functional components"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {
    "slideshow": {
     "slide_type": "subslide"
    }
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<script type=\"text/javascript\" src=\"/notebooks/vis/chord/chord-mapper.js\"></script><link rel=\"stylesheet\" type=\"text/css\" href=\"/notebooks/vis/chord/chord-diagram.css\"><div id=\"tooltip\"></div><div id =\"bc-chord-diagram\"></div><script>require(['d3'], function (d3) {    var data = \"Source,Target,X_Count\\nAttendanceContext,TrainingContext,21\\nTrainingContext,TrainingContext,50\\nTrainingContext,UserContext,18\\nUserContext,UserContext,33\\nAttendanceContext,UserContext,13\\nAttendanceContext,AttendanceContext,41\\n\";    var csvData = d3.csvParse(data);    var mpr = chordMpr(csvData);    mpr      .addValuesToMap(\"Source\")      .addValuesToMap(\"Target\")      .setFilter(function (row, a, b) {        return (row.Source === a.name && row.Target === b.name)      })      .setAccessor(function (recs, a, b) {        if (!recs[0]) return 0;        return +recs[0].X_Count;      });    drawChords(mpr.getMatrix(), mpr.getMap());    function drawChords (matrix, mmap) {    var w = 800, h = 800, r1 = h / 2 - 50, r0 = r1 - 100;    var chord = d3.chord()        .padAngle(.02)        .sortSubgroups(d3.descending)        .sortChords(d3.descending);    var arc = d3.arc()        .innerRadius(r0)        .outerRadius(r0 + 20);    var ribbon = d3.ribbon()        .radius(r0);        var svg = d3.select(\"#bc-chord-diagram\").append(\"svg:svg\")        .attr(\"width\", w)        .attr(\"height\", h)        .append(\"svg:g\")        .attr(\"id\", \"circle\")        .attr(\"transform\", \"translate(\" + w / 2 + \",\" + h / 2 + \")\")        .datum(chord(matrix));    svg.append(\"circle\")        .attr(\"r\", r0 + 20);    var rdr = chordRdr(matrix, mmap);    var g = svg.selectAll(\"g.group\")        .data(function(chords) {            return chords.groups;        })        .enter().append(\"svg:g\")      .attr(\"class\", \"group\")      .on(\"mouseover\", mouseover)      .on(\"mouseout\", function (d) { d3.select(\"#tooltip\").style(\"visibility\", \"hidden\") });    var colors = d3.scaleOrdinal(d3.schemeCategory20);    g.append(\"svg:path\")        .style(\"stroke\", \"black\")        .style(\"fill\", function(d, i) { return colors(i); })        .attr(\"d\", arc);    g.append(\"svg:text\")        .each(function(d) { d.angle = (d.startAngle + d.endAngle) / 2; })        .attr(\"dy\", \".35em\")        .style(\"font-family\", \"helvetica, arial, sans-serif\")        .style(\"font-size\", \"1.3em\")        .attr(\"text-anchor\", function(d) { return d.angle > Math.PI ? \"end\" : null; })        .attr(\"transform\", function(d) {          return \"rotate(\" + (d.angle * 180 / Math.PI - 90) + \")\"              + \"translate(\" + (r0 + 26) + \")\"              + (d.angle > Math.PI ? \"rotate(180)\" : \"\");        })        .text(function(d) { return rdr(d).gname; });    var chordPaths = svg.selectAll(\"path.chord\")        .data(function(chords) {          return chords;        })        .enter().append(\"svg:path\")        .attr(\"class\", \"chord\")        .style(\"stroke\", function(d, i) { return colors(i); })        .style(\"fill\", function(d, i) { return colors(d.source.index); })        .attr(\"d\", ribbon.radius(r0))        .on(\"mouseover\", function (d) {            d3.select(\"#tooltip\")              .style(\"visibility\", \"visible\")              .html(chordTip(rdr(d)))              .style(\"top\", function () { return (d3.event.pageY - 100)+\"px\"})              .style(\"left\", function () { return (d3.event.pageX - 100)+\"px\";})        })        .on(\"mouseout\", function (d) { d3.select(\"#tooltip\").style(\"visibility\", \"hidden\") });      function chordTip (d) {        var p = d3.format(\".2%\"), q = d3.format(\",.3r\");        return \"Chord Info:<br/>\"          + d.sname + \" has \" + Math.round(d.svalue) + \" dependencies on \" + d.tname + \"<br/>\"          + d.tname + \" has \" + Math.round(d.tvalue) + \" dependencies on \" + d.sname      }      function groupTip (d) {        var p = d3.format(\".1%\"), q = d3.format(\",.3r\");        return \"Group Info:<br/>\"            + d.gname + \" defines \" + Math.round(d.gvalue) + \" dependencies\"      }      function mouseover(d, i) {        d3.select(\"#tooltip\")          .style(\"visibility\", \"visible\")          .html(groupTip(rdr(d)))          .style(\"top\", function () { return (d3.event.pageY - 80)+\"px\"})          .style(\"left\", function () { return (d3.event.pageX - 130)+\"px\";});        chordPaths.classed(\"fade\", function(p) {          return p.source.index != i              && p.target.index != i;        });      }    }});</script>"
      ],
      "text/plain": [
       "<IPython.core.display.HTML object>"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "text = Template(open('../vis/chord/chord-diagram.html', 'r').read()\n",
    "                .replace(\"\\n\",\"\")).substitute({\n",
    "                    'chord_data': dependencies.get_dataframe().to_csv(index = False)\n",
    "                        .replace(\"\\r\\n\",\"\\\\n\").replace(\"\\n\",\"\\\\n\"), \n",
    "                    'container': 'bc-chord-diagram'})\n",
    "\n",
    "HTML(text)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Cyclic dependencies between functional components"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <thead>\n",
       "        <tr>\n",
       "            <th>FunctionalComponent1</th>\n",
       "            <th>FunctionalComponent2</th>\n",
       "        </tr>\n",
       "    </thead>\n",
       "    <tbody>\n",
       "    </tbody>\n",
       "</table>"
      ],
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cyclicDependencies"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "subslide"
    }
   },
   "source": [
    "## Next Steps"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "subslide"
    }
   },
   "source": [
    "* Presentation of the results and discussion with domain experts\n",
    "  * If needed: New analysis with more details or with a different focus\n",
    "  \n",
    "* No code refactorings needed as there are no cyclic dependencies\n",
    "  * Functional split needs to be added to the documentation and must be validated with jQAssistant"
   ]
  }
 ],
 "metadata": {
  "extensions": {
   "jupyter_dashboards": {
    "activeView": "grid_default",
    "version": 1,
    "views": {
     "grid_default": {
      "cellMargin": 10,
      "defaultCellHeight": 20,
      "maxColumns": 12,
      "name": "grid",
      "type": "grid"
     },
     "report_default": {
      "name": "report",
      "type": "report"
     }
    }
   }
  },
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
