{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "valued-participant",
   "metadata": {},
   "outputs": [],
   "source": [
    "import pygal as pg\n",
    "\n",
    "%load_ext cypher\n",
    "%config CypherMagic.uri='http://neo4j:neo@localhost:7474/db/data'"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "continuous-harrison",
   "metadata": {},
   "source": [
    "# Analysing organizational structures with Software Analytics"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "simplified-traffic",
   "metadata": {},
   "source": [
    "## Question"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "received-birmingham",
   "metadata": {},
   "source": [
    "<center>What are unknow spots in the source code, i.e. source code that was never touched by one of the current developers?</center>"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "experienced-yield",
   "metadata": {},
   "source": [
    "## Data Sources"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "established-capacity",
   "metadata": {},
   "source": [
    "* Java structures of the system scanned by jQAssistant and available in Neo4j\n",
    "* Git history of the system scanned by jQAssistant and available in Neo4j\n",
    "* List of current developers (provided manually)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "advisory-drove",
   "metadata": {},
   "source": [
    "## Heuristics"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "dental-rendering",
   "metadata": {},
   "source": [
    "* The committer can correctly identified by the authors mail address"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "accredited-ebony",
   "metadata": {},
   "source": [
    "## Validation"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "breathing-alcohol",
   "metadata": {},
   "source": [
    "* Tabular overview of all committers\n",
    "* Tabular overview of all classes, where no one of the current team already worked on"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "caroline-western",
   "metadata": {},
   "source": [
    "## Implementation"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "included-principal",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 nodes deleted.\n",
      "1 properties set.\n",
      "2 relationships created.\n",
      "3 relationship deleted.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <thead>\n",
       "        <tr>\n",
       "            <th>AuthorName</th>\n",
       "            <th>AuthorMail</th>\n",
       "            <th>Duplicates</th>\n",
       "        </tr>\n",
       "    </thead>\n",
       "    <tbody>\n",
       "        <tr>\n",
       "            <td>Stephan Pirnbaum</td>\n",
       "            <td>stephan.pirnbaum@googlemail.com</td>\n",
       "            <td>1</td>\n",
       "        </tr>\n",
       "    </tbody>\n",
       "</table>"
      ],
      "text/plain": [
       "[['Stephan Pirnbaum', 'stephan.pirnbaum@googlemail.com', 1]]"
      ]
     },
     "execution_count": 2,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher\n",
    "// Duplicate removal (manual post processing)\n",
    "WITH [\n",
    "  [\"Stephan Pirnbaum\", \"stephan.pirnbaum@googlemail.com\", \"Stephan.Pirnbaum@googlemail.com\"]\n",
    "] AS authors\n",
    "UNWIND authors AS duplicateAuthor\n",
    "MATCH (author:Author{email: duplicateAuthor[1]}),\n",
    "      (duplicate:Author{email: duplicateAuthor[2]})\n",
    "SET author.name = duplicateAuthor[0]      \n",
    "WITH author, duplicate\n",
    "MATCH (duplicate)-[:COMMITTED]->(c:Commit)\n",
    "MERGE (author)-[:COMMITTED]->(c)\n",
    "DETACH DELETE duplicate\n",
    "RETURN author.name AS AuthorName, author.email AS AuthorMail, count(DISTINCT duplicate) AS Duplicates"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "buried-handle",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <thead>\n",
       "        <tr>\n",
       "            <th>MergeCommits</th>\n",
       "        </tr>\n",
       "    </thead>\n",
       "    <tbody>\n",
       "        <tr>\n",
       "            <td>0</td>\n",
       "        </tr>\n",
       "    </tbody>\n",
       "</table>"
      ],
      "text/plain": [
       "[[0]]"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher\n",
    "//Every :Git:Commit with more than one parent commit is labeled as Merge.\n",
    "MATCH  (c:Commit)-[:HAS_PARENT]->(p:Commit)\n",
    "WITH   c, count(p) as parents\n",
    "WHERE  parents > 1\n",
    "SET    c:Merge\n",
    "RETURN count(c) as MergeCommits"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "monthly-drawing",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "70 properties set.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <thead>\n",
       "        <tr>\n",
       "            <th>Files</th>\n",
       "        </tr>\n",
       "    </thead>\n",
       "    <tbody>\n",
       "        <tr>\n",
       "            <td>70</td>\n",
       "        </tr>\n",
       "    </tbody>\n",
       "</table>"
      ],
      "text/plain": [
       "[[70]]"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher\n",
    "//Copies the relativePath property of :Git:File nodes to the property fileName that is index and allows faster lookups.\n",
    "MATCH  (f:Git:File)\n",
    "SET    f.fileName = f.relativePath\n",
    "RETURN count(f) as Files"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "insured-williams",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "22 relationships created.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <thead>\n",
       "        <tr>\n",
       "            <th>Matches</th>\n",
       "        </tr>\n",
       "    </thead>\n",
       "    <tbody>\n",
       "        <tr>\n",
       "            <td>22</td>\n",
       "        </tr>\n",
       "    </tbody>\n",
       "</table>"
      ],
      "text/plain": [
       "[[22]]"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher\n",
    "//A HAS_SOURCE relationship is created between a :Java:Type and a :Git:File if their source file names match.\n",
    "MATCH  (p:Java:Package)-[:CONTAINS]->(t:Java:Type)\n",
    "WITH   t, p.fileName + \"/\" + t.sourceFileName as sourceFileName // e.g. \"/org/junit/Test.java\"\n",
    "MATCH  (f:Git:File)\n",
    "WHERE  f.fileName ends with sourceFileName\n",
    "MERGE  (t)-[h:HAS_SOURCE]->(f)\n",
    "RETURN count(h) as Matches"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "racial-geography",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 rows affected.\n"
     ]
    }
   ],
   "source": [
    "# Get all committers\n",
    "committers = %cypher \\\n",
    "    MATCH  (author:Author) \\\n",
    "    RETURN author.name AS Name, author.email AS EMail"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "stainless-probability",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "0 rows affected.\n"
     ]
    }
   ],
   "source": [
    "# Get all types changed by authors of the current team\n",
    "unknownTypes = %cypher \\\n",
    "    WITH     [\"stephan.pirnbaum@googlemail.com\"] AS currentAuthors \\\n",
    "    MATCH    (c:Commit)-[:CONTAINS_CHANGE]->(:Change)-[]->(f:Git:File), \\\n",
    "             (f)<-[:HAS_SOURCE]-(t:Type:Java), \\\n",
    "             (a:Author)-[:COMMITTED]->(c) \\\n",
    "    WHERE    NOT c:Merge \\\n",
    "    WITH     t, collect(DISTINCT a.email) AS authors, currentAuthors \\\n",
    "    WHERE    none(a IN currentAuthors WHERE a in authors) \\\n",
    "    RETURN   t.fqn AS Type"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "welcome-village",
   "metadata": {},
   "source": [
    "## Results"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "efficient-hungarian",
   "metadata": {},
   "source": [
    "Following is a list of all commiters."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "dominican-family",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <thead>\n",
       "        <tr>\n",
       "            <th>Name</th>\n",
       "            <th>EMail</th>\n",
       "        </tr>\n",
       "    </thead>\n",
       "    <tbody>\n",
       "        <tr>\n",
       "            <td>Stephan Pirnbaum</td>\n",
       "            <td>stephan.pirnbaum@googlemail.com</td>\n",
       "        </tr>\n",
       "    </tbody>\n",
       "</table>"
      ],
      "text/plain": [
       "[['Stephan Pirnbaum', 'stephan.pirnbaum@googlemail.com']]"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "committers"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "nutritional-hepatitis",
   "metadata": {},
   "source": [
    "Following is a list of classes that was never changed by any of he current developers."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "impaired-breakfast",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <thead>\n",
       "        <tr>\n",
       "            <th>Type</th>\n",
       "        </tr>\n",
       "    </thead>\n",
       "    <tbody>\n",
       "    </tbody>\n",
       "</table>"
      ],
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "unknownTypes"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "structured-scholarship",
   "metadata": {},
   "source": [
    "## Next Steps"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "rapid-newman",
   "metadata": {},
   "source": [
    "* It was found that there are no locations that are unknown by the current developers\n",
    "  * This needs to be monitored whenever someone is about to leave so that proper handover sessions can be planned"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
